---Оконные функции
/*
Инструкция OVER определяет окно функции относительно текущей строки
Это определение справедлиов для всех строк в итоговом наборе данных.
Для каждой строки инструкции OVER определяет окно, независимое от окон,
определенных для других строк.

Определение множества Георг Кантор:
"Под множеством мы подразумеваем любов объединение M в одно целое,
состоящее из определенных различающихся объектов m (называемых элементами)
в области наших мыслей и восприятий."


-Целое. Множество должно всоприниматься и управляться как целое единое
целое. То есть с ним необходимо работать как с общностью данных,
а не разрозненным набором элементов. В процессе выполнения итератинвого перебора
это правило нарушается, поскольку записи из файла или курсора обрабатывается
по одной.
Таблица SQL представляет (хотя и несовсем успешно) отношения в реляционной
модели.
Отношением называется общность похожих элементов, то есть обладающих
одинковым набором аттрибутов. Взаимодействуя сс таблицами при помощи
запросов, базирующихся на наборах данных, вы работаете с ними
как с единым целым, а не как с набором отдельных строк (кортежей в
отношении), как в отношении формулирования декларативных запросов SQL,
так ис точки зрения мышления и общего подхода.
Приобрести подобный взгляж является огромной проблемой.

-Отсутствие строгого порядка. В определении множестве ничего не скаазано
про порядок расположения элементов в нем.


*/